#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_resource_group.tc-g8-resource-group will be created
  + resource "azurerm_resource_group" "tc-g8-resource-group" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "tc-g8-resources"
    }

  # module.acr.azurerm_container_registry.acr will be created
  + resource "azurerm_container_registry" "acr" {
      + admin_enabled                 = false
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "eastus"
      + login_server                  = (known after apply)
      + name                          = "acrrepository"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "tc-g8-resources"
      + retention_policy              = (known after apply)
      + sku                           = "Basic"
      + trust_policy                  = (known after apply)
      + zone_redundancy_enabled       = false
    }

  # module.cluster.azurerm_kubernetes_cluster.tech-challenge-k8s will be created
  + resource "azurerm_kubernetes_cluster" "tech-challenge-k8s" {
      + api_server_authorized_ip_ranges     = (known after apply)
      + dns_prefix                          = "tech-challenge-k8s"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = false
      + image_cleaner_interval_hours        = 48
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = (known after apply)
      + location                            = "eastus"
      + name                                = "tech-challenge-k8s"
      + node_resource_group                 = (known after apply)
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + public_network_access_enabled       = true
      + resource_group_name                 = "tc-g8-resources"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Free"
      + support_plan                        = "KubernetesOfficial"
      + workload_identity_enabled           = false

      + default_node_pool {
          + kubelet_disk_type    = (known after apply)
          + max_pods             = (known after apply)
          + name                 = "defaultpool"
          + node_count           = 1
          + node_labels          = (known after apply)
          + orchestrator_version = (known after apply)
          + os_disk_size_gb      = (known after apply)
          + os_disk_type         = "Managed"
          + os_sku               = (known after apply)
          + scale_down_mode      = "Delete"
          + type                 = "VirtualMachineScaleSets"
          + ultra_ssd_enabled    = false
          + vm_size              = "Standard_B2S"
          + workload_runtime     = (known after apply)
        }

      + service_principal {
          + client_id     = "0000000"
          + client_secret = (sensitive value)
        }
    }

  # module.cluster.azurerm_kubernetes_cluster_node_pool.cluster-node-pool will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "cluster-node-pool" {
      + id                    = (known after apply)
      + kubelet_disk_type     = (known after apply)
      + kubernetes_cluster_id = (known after apply)
      + max_pods              = (known after apply)
      + mode                  = "User"
      + name                  = "internal"
      + node_count            = 1
      + node_labels           = (known after apply)
      + orchestrator_version  = (known after apply)
      + os_disk_size_gb       = (known after apply)
      + os_disk_type          = "Managed"
      + os_sku                = (known after apply)
      + os_type               = "Linux"
      + priority              = "Regular"
      + scale_down_mode       = "Delete"
      + spot_max_price        = -1
      + ultra_ssd_enabled     = false
      + vm_size               = "Standard_B2S"
    }

  # module.function.azurerm_function_app_function.tc-g8-app-function will be created
  + resource "azurerm_function_app_function" "tc-g8-app-function" {
      + config_json          = jsonencode(
            {
              + bindings = [
                  + {
                      + authLevel = "function"
                      + direction = "in"
                      + methods   = [
                          + "get",
                          + "post",
                        ]
                      + name      = "req"
                      + type      = "httpTrigger"
                    },
                  + {
                      + direction = "out"
                      + name      = "res"
                      + type      = "http"
                    },
                ]
            }
        )
      + config_url           = (known after apply)
      + enabled              = true
      + function_app_id      = (known after apply)
      + id                   = (known after apply)
      + invocation_url       = (known after apply)
      + language             = "Javascript"
      + name                 = "tc-g8-app-function"
      + script_root_path_url = (known after apply)
      + script_url           = (known after apply)
      + secrets_file_url     = (known after apply)
      + test_data_url        = (known after apply)
      + url                  = (known after apply)

      + file {
          + content = <<-EOT
                module.exports = async function (context, req) {
                    context.log(`Consultando dados do endereço para o CEP: ${req.query.cep}`);
                    
                    const requestTest = await fetch(`https://viacep.com.br/ws/${req.query.cep}/json`);
                
                    const responseTest = await requestTest.json();
                
                    context.res = {
                        // status: 200, /* Defaults to 200 */
                        body: responseTest
                    };
                }
            EOT
          + name    = "index.js"
        }
      + file {
          + content = jsonencode(
                {
                  + extensionBundle = {
                      + id      = "Microsoft.Azure.Functions.ExtensionBundle"
                      + version = "[4.*, 5.0.0)"
                    }
                  + logging         = {
                      + applicationInsights = {
                          + samplingSettings = {
                              + excludedTypes = "Request"
                              + isEnabled     = true
                            }
                        }
                    }
                  + version         = "2.0"
                }
            )
          + name    = "host.json"
        }
    }

  # module.function.azurerm_linux_function_app.tc-g8-function-app will be created
  + resource "azurerm_linux_function_app" "tc-g8-function-app" {
      + app_settings                                   = {
          + "FUNCTIONS_WORKER_RUNTIME" = "node"
        }
      + builtin_logging_enabled                        = true
      + client_certificate_enabled                     = false
      + client_certificate_mode                        = "Optional"
      + content_share_force_disabled                   = false
      + custom_domain_verification_id                  = (sensitive value)
      + daily_memory_time_quota                        = 0
      + default_hostname                               = (known after apply)
      + enabled                                        = true
      + ftp_publish_basic_authentication_enabled       = true
      + functions_extension_version                    = "~4"
      + hosting_environment_id                         = (known after apply)
      + https_only                                     = false
      + id                                             = (known after apply)
      + key_vault_reference_identity_id                = (known after apply)
      + kind                                           = (known after apply)
      + location                                       = "eastus"
      + name                                           = "tc-g8-function-app"
      + outbound_ip_address_list                       = (known after apply)
      + outbound_ip_addresses                          = (known after apply)
      + possible_outbound_ip_address_list              = (known after apply)
      + possible_outbound_ip_addresses                 = (known after apply)
      + public_network_access_enabled                  = true
      + resource_group_name                            = "tc-g8-resources"
      + service_plan_id                                = (known after apply)
      + site_credential                                = (sensitive value)
      + storage_account_access_key                     = (sensitive value)
      + storage_account_name                           = "g8fiaptc"
      + storage_uses_managed_identity                  = false
      + tags                                           = {
          + "Environment" = "Development"
          + "Name"        = "Function to 3SOAT Tech Challenge"
        }
      + webdeploy_publish_basic_authentication_enabled = true
      + zip_deploy_file                                = (known after apply)

      + site_config {
          + always_on                               = (known after apply)
          + app_scale_limit                         = (known after apply)
          + container_registry_use_managed_identity = false
          + default_documents                       = (known after apply)
          + detailed_error_logging_enabled          = (known after apply)
          + elastic_instance_minimum                = (known after apply)
          + ftps_state                              = "Disabled"
          + health_check_eviction_time_in_min       = (known after apply)
          + http2_enabled                           = false
          + linux_fx_version                        = (known after apply)
          + load_balancing_mode                     = "LeastRequests"
          + managed_pipeline_mode                   = "Integrated"
          + minimum_tls_version                     = "1.2"
          + pre_warmed_instance_count               = (known after apply)
          + remote_debugging_enabled                = false
          + remote_debugging_version                = (known after apply)
          + scm_minimum_tls_version                 = "1.2"
          + scm_type                                = (known after apply)
          + scm_use_main_ip_restriction             = false
          + use_32_bit_worker                       = false
          + vnet_route_all_enabled                  = false
          + websockets_enabled                      = false
          + worker_count                            = (known after apply)

          + application_stack {
              + node_version                = "18"
              + use_dotnet_isolated_runtime = false
            }
        }
    }

  # module.function.azurerm_service_plan.tc-g8-service-plan will be created
  + resource "azurerm_service_plan" "tc-g8-service-plan" {
      + id                           = (known after apply)
      + kind                         = (known after apply)
      + location                     = "eastus"
      + maximum_elastic_worker_count = (known after apply)
      + name                         = "tc-g8-service-plan"
      + os_type                      = "Linux"
      + per_site_scaling_enabled     = false
      + reserved                     = (known after apply)
      + resource_group_name          = "tc-g8-resources"
      + sku_name                     = "Y1"
      + worker_count                 = (known after apply)
    }

  # module.function.azurerm_storage_account.tc-g8-storage-account will be created
  + resource "azurerm_storage_account" "tc-g8-storage-account" {
      + access_tier                        = (known after apply)
      + account_kind                       = "Storage"
      + account_replication_type           = "LRS"
      + account_tier                       = "Standard"
      + allow_nested_items_to_be_public    = true
      + cross_tenant_replication_enabled   = true
      + default_to_oauth_authentication    = false
      + enable_https_traffic_only          = true
      + id                                 = (known after apply)
      + infrastructure_encryption_enabled  = false
      + is_hns_enabled                     = false
      + large_file_share_enabled           = (known after apply)
      + local_user_enabled                 = true
      + location                           = "eastus"
      + min_tls_version                    = "TLS1_2"
      + name                               = "g8fiaptc"
      + nfsv3_enabled                      = false
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + public_network_access_enabled      = true
      + queue_encryption_key_type          = "Service"
      + resource_group_name                = "tc-g8-resources"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + sftp_enabled                       = false
      + shared_access_key_enabled          = true
      + table_encryption_key_type          = "Service"
    }

  # module.postgres.azurerm_postgresql_database.tc-g8-postgres-db will be created
  + resource "azurerm_postgresql_database" "tc-g8-postgres-db" {
      + charset             = "UTF8"
      + collation           = "English_United States.1252"
      + id                  = (known after apply)
      + name                = "tc-g8-postgres-db"
      + resource_group_name = "tc-g8-resources"
      + server_name         = "tc-g8-postgres-server"
    }

  # module.postgres.azurerm_postgresql_firewall_rule.tc-g8-postgres-db-firewall-rule will be created
  + resource "azurerm_postgresql_firewall_rule" "tc-g8-postgres-db-firewall-rule" {
      + end_ip_address      = "255.255.255.255"
      + id                  = (known after apply)
      + name                = "tc-g8-postgres-db-firewall-rule"
      + resource_group_name = "tc-g8-resources"
      + server_name         = "tc-g8-postgres-server"
      + start_ip_address    = "0.0.0.0"
    }

  # module.postgres.azurerm_postgresql_server.tc-g8-postgres-server will be created
  + resource "azurerm_postgresql_server" "tc-g8-postgres-server" {
      + administrator_login              = "psqladmin"
      + administrator_login_password     = (sensitive value)
      + auto_grow_enabled                = true
      + backup_retention_days            = 7
      + create_mode                      = "Default"
      + fqdn                             = (known after apply)
      + geo_redundant_backup_enabled     = false
      + id                               = (known after apply)
      + location                         = "eastus"
      + name                             = "tc-g8-postgres-server"
      + public_network_access_enabled    = true
      + resource_group_name              = "tc-g8-resources"
      + sku_name                         = "B_Gen5_1"
      + ssl_enforcement_enabled          = false
      + ssl_minimal_tls_version_enforced = "TLSEnforcementDisabled"
      + storage_mb                       = 5120
      + version                          = "11"
    }

Plan: 11 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + function_name = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @wen-dell, Action: `pull_request`*